export const STATUS_COLORS = {
    104: '#3b82f6', // (Started - הונחה על שולחן הכנסת לדיון מוקדם)            = Blue
    106: '#2f00ff', // (Decide commitee - בוועדת הכנסת לקביעת הוועדה המטפלת)   = Dark Blue
    108: '#dbbc0b', // (Passed first step - הכנה לקריאה ראשונה)                 = Mustard
    111: '#706e61ff', // לדיון במליאה לקראת הקריאה הראשונה                     = Gray
    113: '#40c320', // (Passed second step - הכנה לקריאה שנייה ושלישית)         = Green
    118: '#106b31', // (Passed - התקבלה בקריאה שלישית)                          = Forest Green
    122: '#640cca', // (Merged with another bill - מוזגה עם הצעת חוק אחרת)      = Purple
    124: '#b71adb', // (Moved to daily meeting - הוסבה להצעה לסדר היום)         = Pink
    141: '#d61777', // הונחה על שולחן הכנסת לקריאה ראשונה                      = Majenta
    130: '#f5740b', // הונחה על שולחן הכנסת לקריאה שנייה-שלישית                = Dark Orange
    150: '#0bbfbf', // (In Committee for the first step - במליאה לדיון מוקדם)   = Light Blue
    177: '#d62a2a', // (Stopped - נעצרה)                                         = Red
    
};

export const STATUS_DESC = {
    104: "הונחה על שולחן הכנסת לדיון מוקדם",
    106: "בוועדת הכנסת לקביעת הוועדה המטפלת",
    108: "הכנה לקריאה ראשונה",
    111: "לדיון במליאה לקראת הקריאה הראשונה",
    113: "הכנה לקריאה שנייה ושלישית",
    118: "התקבלה בקריאה שלישית",
    122: "מוזגה עם הצעת חוק אחרת",
    124: "הוסבה להצעה לסדר היום",
    130: "הונחה על שולחן הכנסת לקריאה שנייה-שלישית",
    141: "הונחה על שולחן הכנסת לקריאה ראשונה",
    150: "במליאה לדיון מוקדם",
    177: "נעצרה"
};
