export const SUBJECTS_ARRAY = [
    { 
        id: 'road_safety', 
        label: 'בטיחות בדרכים', 
        path: '/timeline/road_safety', 
        keywords: ["תעבורה", "תאונות דרכים", "בטיחות בדרכים", "חוק הדרכים"],
    },
    { 
        id: 'education', 
        label: 'חינוך', 
        path: '/timeline/education', 
        keywords: ["חינוך", "בתי ספר", "מורים", "השכלה גבוהה", "מעונות יום"],
    }, 
    { 
        id: 'health', 
        label: 'בריאות', 
        path: '/timeline/health', 
        keywords: ["תחלואה", "חיסונים", "קורונה", "בתי חולים", "חולים", "חיסונים", "חיסון"],
    },
    { 
        id: 'crime', 
        label: 'פשיעה', 
        path: '/timeline/crime', 
        keywords: ["משטרה", "שוטר", "פשע", "נשק", "פציעה"],
    }
];


export const SUBJECTS_DICT = {
    'road_safety': { 
        label: 'בטיחות בדרכים', 
        description: "יצרנו את המדד הלאומי לבטיחות בדרכים. המדד מחושב לפי שקלול חודשי של סיווג תאונות דרכים עם רמות חומרה שונות ומנורמל על פי גודל האוכלוסיה."
    },
    'education': { 
        label: 'חינוך', 
        description: "יצרנו את המדד הלאומי לאיכות החינוך. המדד מחושב על פי ממוצע תלמידים בכיתה בבתי ספר וגנים, יחס כמות מורים לתלמידים, אחוז זכאות לבגרות רגילה וטכנולוגית, אחוז נשירה ועוד."
    }, 
    'health': { 
        label: 'בריאות', 
        description: "יצרנו את המדד הלאומי לבריאות. המדד מחושב על פי כמות כוח אדם רפואי ביחס לכמות האזרחים, בריאות הנפש, הפרעות אכילה בילדים, צפיפות בבתי חולים,  ועוד." 
    },
    'crime': { 
        label: 'פשיעה', 
        description: "יצרנו את המדד הלאומי לפשיעה. המדד מחושב על פי תחושת הביטחון הכללית של האזרח הישראלי, סוגי עבירות אשר הובילו לפתיחת תיקים, אלימות כלפי נשים, גניבות ועוד. "
    }
};